<a href="https://colab.research.google.com/github/lokeshkumarn/Notebooks/blob/master/BankTermDeposit.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import os
import numpy as np
import pandas as pd

#Visualizations
import matplotlib as mpl
from matplotlib import pyplot as plt

#Modeling
import sklearn

Load the Data

In [0]:
data = pd.read_excel('Bank Data for case study assignment.xlsx')

In [3]:
data.head()

   age          job marital status   ... housing loan? Personal loan   y
0   30   unemployed         married  ...            no            no  no
1   33     services         married  ...           yes           yes  no
2   35   management          single  ...           yes            no  no
3   30   management         married  ...           yes           yes  no
4   59  blue-collar         married  ...           yes            no  no

[5 rows x 8 columns]

Exploratory Data Analysis and Statistical Analysis

In [4]:
data.columns

Index(['age', 'job', 'marital status ', 'education', 'credit default?',
       'housing loan?', 'Personal loan', 'y'],
      dtype='object')

Column Marital Status is having extra space in the end, just rename it without space in the end

In [0]:
data.rename(columns={'marital status ':'marital status'},inplace=True)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1021 entries, 0 to 1020
Data columns (total 8 columns):
age                1021 non-null int64
job                1019 non-null object
marital status     1020 non-null object
education          1020 non-null object
credit default?    1020 non-null object
housing loan?      1019 non-null object
Personal loan      1019 non-null object
y                  1021 non-null object
dtypes: int64(1), object(7)
memory usage: 63.9+ KB

Total 1021 records in that Marital Status, Education, Credit Default having 1 missing data and Job,Housing Loan, Personal Loan has two missing data

First fill the missing  value for the job

In [7]:
data[data['job'].isnull()]

      age  job marital status  ... housing loan? Personal loan    y
79     40  NaN        married  ...           yes            no   no
1004   42  NaN         single  ...           yes           yes  yes

[2 rows x 8 columns]

Taking the first record from above and looking for data whose attribute values are similar to that of the missing value and decide how to replace the missing value

In [8]:
data[(data['age']== 40) & 
     (data['marital status'] =='married') & 
     (data['education'] =='secondary') & 
     (data['credit default?'] =='no') & 
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='no') & 
     (data['y'] =='no') & 
     (data['job'].isnull()==False)]

      age          job marital status  ... housing loan? Personal loan   y
270    40     services        married  ...           yes            no  no
482    40   technician        married  ...           yes            no  no
597    40   management        married  ...           yes            no  no
671    40   technician        married  ...           yes            no  no
684    40     services        married  ...           yes            no  no
710    40   technician        married  ...           yes            no  no
960    40   technician        married  ...           yes            no  no
1012   40  blue-collar        married  ...           yes            no  no

[8 rows x 8 columns]

Taking the Mode and imputing the missing value for job

In [9]:
data[(data['age']== 40) & 
     (data['marital status'] =='married') & 
     (data['education'] =='secondary')& 
     (data['credit default?'] =='no') & 
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='no') & 
     (data['job'].isnull()==False)]['job'].mode()

0    technician
dtype: object

In [10]:
data[(data['age']== 40) & 
     (data['marital status'] =='married') & 
     (data['education'] =='secondary') & 
     (data['credit default?'] =='no') &
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='no')& 
     (data['job'].isnull()==True)]

    age  job marital status  ... housing loan? Personal loan   y
79   40  NaN        married  ...           yes            no  no

[1 rows x 8 columns]

imputing the new value for job using the mod value of job whose attributes had similar values as that of the missing values

In [0]:
data.loc[(data['age']== 40) & 
         (data['marital status'] =='married') & 
         (data['education'] =='secondary')    & 
         (data['credit default?'] =='no') & 
         (data['housing loan?'] =='yes') & 
         (data['Personal loan'] =='no')
    & (data['job'].isnull()==True),'job']=\
data[(data['age']== 40) & 
     (data['marital status'] =='married') & 
     (data['education'] =='secondary')    & 
     (data['credit default?'] =='no') & 
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='no')    & 
     (data['job'].isnull()==False)]['job'].mode()[0]

In [12]:
data[data['job'].isnull()]

      age  job marital status  ... housing loan? Personal loan    y
1004   42  NaN         single  ...           yes           yes  yes

[1 rows x 8 columns]

Data imputed, from the above it is clear that only one is missing right now and do the similar kind of operation for above record also

In [13]:
data[(data['age']== 42) & 
     (data['marital status'] =='single') & 
     (data['education'] =='secondary') & 
     (data['credit default?'] =='no') & 
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='yes') & 
     (data['y'] =='yes') & 
     (data['job'].isnull()==False)]

Empty DataFrame
Columns: [age, job, marital status, education, credit default?, housing loan?, Personal loan, y]
Index: []

No data available for similar values.So look in broader scope

Remove the Marital Status and check

In [14]:
data[(data['age']== 42) & 
     (data['education'] =='secondary') & 
     (data['credit default?'] =='no') & 
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='yes') & 
     (data['y'] =='yes') & 
     (data['job'].isnull()==False)]

Empty DataFrame
Columns: [age, job, marital status, education, credit default?, housing loan?, Personal loan, y]
Index: []

Remove Education also and check

In [15]:
data[(data['age']== 42) & 
     (data['credit default?'] =='no') & 
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='yes') & 
     (data['y'] =='yes') & 
     (data['job'].isnull()==False)]

Empty DataFrame
Columns: [age, job, marital status, education, credit default?, housing loan?, Personal loan, y]
Index: []

Remove credit default

In [16]:
data[(data['age']== 42) & 
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='yes') & 
     (data['y'] =='yes') & 
     (data['job'].isnull()==False)]

Empty DataFrame
Columns: [age, job, marital status, education, credit default?, housing loan?, Personal loan, y]
Index: []

Remove housing loan

In [17]:
data[(data['age']== 42) &  
     (data['Personal loan'] =='yes') & 
     (data['y'] =='yes') & 
     (data['job'].isnull()==False)]

Empty DataFrame
Columns: [age, job, marital status, education, credit default?, housing loan?, Personal loan, y]
Index: []

Remove the Personal loan also from condition

In [18]:
data[(data['age']== 42) &  
     (data['y'] =='yes') & 
     (data['job'].isnull()==False)]

     age         job marital status  ... housing loan? Personal loan    y
215   42  management        married  ...           yes            no  yes

[1 rows x 8 columns]

Finally we got that the missing value based on the result from above. So lets impute the job value to the missing value

In [19]:
data[(data['age']== 42) &  
     (data['y'] =='yes') & 
     (data['job'].isnull()==False)]['job'].mode()[0]

'management'

In [20]:
data[(data['age']== 42) & 
     (data['marital status'] =='single') & 
     (data['education'] =='secondary') & 
     (data['credit default?'] =='no') & 
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='yes') & 
     (data['y'] =='yes') & 
     (data['job'].isnull()==True)]

      age  job marital status  ... housing loan? Personal loan    y
1004   42  NaN         single  ...           yes           yes  yes

[1 rows x 8 columns]

In [0]:
data.loc[(data['age']== 42) & 
     (data['marital status'] =='single') & 
     (data['education'] =='secondary') & 
     (data['credit default?'] =='no') & 
     (data['housing loan?'] =='yes') & 
     (data['Personal loan'] =='yes') & 
     (data['y'] =='yes') & 
     (data['job'].isnull()==True),'job']=\
data[(data['age']== 42) &  
     (data['y'] =='yes') & 
     (data['job'].isnull()==False)
    ]['job'].mode()[0]

Lets check the whether the values are imputed to the job

In [22]:
data[data['job'].isnull()]

Empty DataFrame
Columns: [age, job, marital status, education, credit default?, housing loan?, Personal loan, y]
Index: []

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1021 entries, 0 to 1020
Data columns (total 8 columns):
age                1021 non-null int64
job                1021 non-null object
marital status     1020 non-null object
education          1020 non-null object
credit default?    1020 non-null object
housing loan?      1019 non-null object
Personal loan      1019 non-null object
y                  1021 non-null object
dtypes: int64(1), object(7)
memory usage: 63.9+ KB

No empty values in job, so lets move on to the next attribute housing loan

In [24]:
data[data['housing loan?'].isnull()]

      age        job marital status  ... housing loan? Personal loan   y
109    27  housemaid        married  ...           NaN           NaN  no
1016   33   services        married  ...           NaN            no  no

[2 rows x 8 columns]

as the first row has missing values in personal loan as well, so lets focus on the second row

In [25]:
data[(data['age']==33) &
    (data['job']=='services') &
    (data['marital status']=='married') &
    (data['education']=='secondary') &
    (data['credit default?']=='no') &
    (data['housing loan?'].isnull()==False) &
    (data['Personal loan']=='no') &
    (data['y']=='no')]

      age       job marital status  ... housing loan? Personal loan   y
1007   33  services        married  ...           yes            no  no

[1 rows x 8 columns]

lets impute the value based on the above result

In [26]:
data[(data['age']==33) &
    (data['job']=='services') &
    (data['marital status']=='married') &
    (data['education']=='secondary') &
    (data['credit default?']=='no') &
    (data['housing loan?'].isnull()==False) &
    (data['Personal loan']=='no') &
    (data['y']=='no')]['job'].mode()[0]

'services'

In [0]:
data.loc[(data['age']==33) &
    (data['job']=='services') &
    (data['marital status']=='married') &
    (data['education']=='secondary') &
    (data['credit default?']=='no') &
    (data['housing loan?'].isnull()) &
    (data['Personal loan']=='no') &
    (data['y']=='no'),'housing loan?']=\
data[(data['age']==33) &
    (data['job']=='services') &
    (data['marital status']=='married') &
    (data['education']=='secondary') &
    (data['credit default?']=='no') &
    (data['housing loan?'].isnull()==False) &
    (data['Personal loan']=='no') &
    (data['y']=='no')]['job'].mode()[0]

In [28]:
data[data['housing loan?'].isnull()]

     age        job marital status  ... housing loan? Personal loan   y
109   27  housemaid        married  ...           NaN           NaN  no

[1 rows x 8 columns]

In [29]:
data[(data['age']==27) &
    (data['job']=='housemaid') &
    (data['marital status']=='married') &
    (data['education']=='primary') &
    (data['credit default?']=='no') &
    (data['housing loan?'].isnull()==False) &
    (data['y']=='no')]

Empty DataFrame
Columns: [age, job, marital status, education, credit default?, housing loan?, Personal loan, y]
Index: []

since we dont have data for matching attribute values , lets check in that age we have data

In [30]:
data[data['age']==27].head()

     age            job marital status  ... housing loan? Personal loan    y
80    27         admin.       divorced  ...           yes            no  yes
92    27       services         single  ...           yes            no  yes
109   27      housemaid        married  ...           NaN           NaN   no
134   27     technician         single  ...           yes            no   no
158   27  self-employed         single  ...            no            no   no

[5 rows x 8 columns]

as we have many samples, lets add another condition that do we have housemaid more than one that is apart the one which has missing value

In [31]:
data[(data['age']==27) & (data['job']=='housemaid') & (data['housing loan?'].isnull()==False)]

Empty DataFrame
Columns: [age, job, marital status, education, credit default?, housing loan?, Personal loan, y]
Index: []

As the data is not available, lets put a range to the age as 25-30

In [32]:
data[(data['age'] >= 25) & (data['age'] <= 30) & (data['job']=='housemaid') & (data['housing loan?'].isnull()==False)]

     age        job marital status  ... housing loan? Personal loan   y
24    26  housemaid        married  ...            no            no  no
830   30  housemaid         single  ...            no            no  no
854   26  housemaid        married  ...           yes            no  no

[3 rows x 8 columns]

as the data is not giving clear idea to decide on the value, so lets try with other attributes

In [33]:
data[(data['age'] >= 25) & (data['age'] <=30) &
     (data['education']=='primary') & 
     (data['marital status']=='married') &
     (data['credit default?']=='no') &
     (data['y']=='no') &
     (data['housing loan?'].isnull()==False)
    ]

     age          job marital status  ... housing loan? Personal loan   y
0     30   unemployed        married  ...            no            no  no
47    26  blue-collar        married  ...           yes            no  no
315   30  blue-collar        married  ...           yes            no  no
972   29  blue-collar        married  ...           yes            no  no

[4 rows x 8 columns]

In [34]:
data[(data['age'] >= 25) & (data['age'] <=30) &
     (data['education']=='primary') & 
     (data['marital status']=='married') &
     (data['credit default?']=='no') &
     (data['y']=='no') &
     (data['housing loan?'].isnull()==False)
    ]['housing loan?'].mode()

0    yes
dtype: object

we got a value to impute, lets impute to the missing housing loan

In [0]:
data.loc[(data['age']==27) &
    (data['job']=='housemaid') &
    (data['marital status']=='married') &
    (data['education']=='primary') &
    (data['credit default?']=='no') &
    (data['housing loan?'].isnull()==True) &
    (data['y']=='no'),'housing loan?']= \
data[(data['age'] >= 25) & (data['age'] <=30) &
     (data['education']=='primary') & 
     (data['marital status']=='married') &
     (data['credit default?']=='no') &
     (data['y']=='no') &
     (data['housing loan?'].isnull()==False)
    ]['housing loan?'].mode()[0]

Lets analyse and impute the missing values for the remaining attributes

In [36]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1021 entries, 0 to 1020
Data columns (total 8 columns):
age                1021 non-null int64
job                1021 non-null object
marital status     1020 non-null object
education          1020 non-null object
credit default?    1020 non-null object
housing loan?      1021 non-null object
Personal loan      1019 non-null object
y                  1021 non-null object
dtypes: int64(1), object(7)
memory usage: 63.9+ KB

now concentrate on the personal loan

In [37]:
data[data['Personal loan'].isnull()]

      age        job marital status  ... housing loan? Personal loan   y
109    27  housemaid        married  ...           yes           NaN  no
1000   38     admin.        married  ...           yes           NaN  no

[2 rows x 8 columns]

In [38]:
data[(data['age'] >= 25) & (data['age'] <= 30) &
     (data['marital status'] == 'married') &
     (data['education']=='primary')&
     (data['credit default?']=='no') &
     (data['housing loan?']=='yes') &
     (data['y']=='no') &
     (data['Personal loan'].isnull()==False)
    ]['Personal loan'].mode()

0    no
dtype: object

In [39]:
data[(data['age'] >= 25) & (data['age'] <= 30) &
     (data['marital status'] == 'married') &
     (data['education']=='primary')&
     (data['credit default?']=='no') &
     (data['housing loan?']=='yes') &
     (data['y']=='no') &
     (data['Personal loan'].isnull())
    ]

     age        job marital status  ... housing loan? Personal loan   y
109   27  housemaid        married  ...           yes           NaN  no

[1 rows x 8 columns]

In [0]:
data.loc[(data['age'] == 27) &
     (data['marital status'] == 'married') &
     (data['education']=='primary')&
     (data['credit default?']=='no') &
     (data['housing loan?']=='yes') &
     (data['y']=='no') &
     (data['Personal loan'].isnull())
    ,'Personal loan'] =\
data[(data['age'] >= 25) & (data['age'] <= 30) &
     (data['marital status'] == 'married') &
     (data['education']=='primary')&
     (data['credit default?']=='no') &
     (data['housing loan?']=='yes') &
     (data['y']=='no') &
     (data['Personal loan'].isnull()==False)
    ]['Personal loan'].mode()[0]

In [41]:
data[data['Personal loan'].isnull()]

      age     job marital status  ... housing loan? Personal loan   y
1000   38  admin.        married  ...           yes           NaN  no

[1 rows x 8 columns]

As one of the value is imputed with the mode, lets look for the above remaining one

In [42]:
data[(data['age'] ==38)&
     (data['job']=='admin.') &
     (data['marital status'] == 'married') &
     (data['education']=='secondary')&
     (data['credit default?']=='no') &
     (data['housing loan?']=='yes') &
     (data['y']=='no') &
     (data['Personal loan'].isnull()==False)
    ]

    age     job marital status  ... housing loan? Personal loan   y
88   38  admin.        married  ...           yes            no  no

[1 rows x 8 columns]

as we have data with similar values,now impute and remove the duplicates from overall data

In [0]:
data.loc[(data['age'] ==38)&
     (data['job']=='admin.') &
     (data['marital status'] == 'married') &
     (data['education']=='secondary')&
     (data['credit default?']=='no') &
     (data['housing loan?']=='yes') &
     (data['y']=='no') &
     (data['Personal loan'].isnull()==True)
    ,'Personal loan'] = \
data[(data['age'] ==38)&
     (data['job']=='admin.') &
     (data['marital status'] == 'married') &
     (data['education']=='secondary')&
     (data['credit default?']=='no') &
     (data['housing loan?']=='yes') &
     (data['y']=='no') &
     (data['Personal loan'].isnull()==False)
    ]['Personal loan'].mode()[0]

In [44]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1021 entries, 0 to 1020
Data columns (total 8 columns):
age                1021 non-null int64
job                1021 non-null object
marital status     1020 non-null object
education          1020 non-null object
credit default?    1020 non-null object
housing loan?      1021 non-null object
Personal loan      1021 non-null object
y                  1021 non-null object
dtypes: int64(1), object(7)
memory usage: 63.9+ KB

As the two missing values are filled lets move our focus to the one missing values

In [45]:
data[data['marital status'].isnull()]

     age         job marital status  ... housing loan? Personal loan    y
108   56  unemployed            NaN  ...            no            no  yes

[1 rows x 8 columns]

In [46]:
data[(data['age']==56) &
     (data['job']=='unemployed') &
     (data['y']=='yes')
    ]

     age         job marital status  ... housing loan? Personal loan    y
108   56  unemployed            NaN  ...            no            no  yes

[1 rows x 8 columns]

In [50]:
data[(data['age'] >= 55) & (data['age'] <= 60) &
     (data['job']=='unemployed') &
     (data['y']=='yes')
    ]

     age         job marital status  ... housing loan? Personal loan    y
108   56  unemployed            NaN  ...            no            no  yes

[1 rows x 8 columns]

In [57]:
data[(data['job']=='unemployed') &
     (data['credit default?']=='no') &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='yes') &
     (data['marital status'].isnull()== False)
    ]['marital status'].mode()[0]

'married'

lets impute this nearest value

In [0]:
data.loc[(data['age']==56) &
     (data['job']=='unemployed')&
     (data['education']=='primary')&
     (data['credit default?']=='no') &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='yes') &
     (data['marital status'].isnull())
    ,'marital status'] =\
data[(data['job']=='unemployed') &
     (data['credit default?']=='no') &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='yes') &
     (data['marital status'].isnull()== False)
    ]['marital status'].mode()[0]

In [62]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1021 entries, 0 to 1020
Data columns (total 8 columns):
age                1021 non-null int64
job                1021 non-null object
marital status     1021 non-null object
education          1020 non-null object
credit default?    1020 non-null object
housing loan?      1021 non-null object
Personal loan      1021 non-null object
y                  1021 non-null object
dtypes: int64(1), object(7)
memory usage: 63.9+ KB

lets fill the missing value of the education

In [63]:
data[data['education'].isnull()]

    age     job marital status  ... housing loan? Personal loan   y
97   30  admin.         single  ...            no            no  no

[1 rows x 8 columns]

In [65]:
data[(data['age']==30) &
     (data['job']=='admin.')
    ]

     age     job marital status  ... housing loan? Personal loan   y
97    30  admin.         single  ...            no            no  no
441   30  admin.         single  ...           yes            no  no
647   30  admin.        married  ...           yes            no  no

[3 rows x 8 columns]

In [69]:
data[(data['age']==30) &
     (data['marital status']=='single') &
     (data['credit default?']=='no') &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='no') &
     (data['education'].isnull()==False) 
    ]

     age           job marital status  ... housing loan? Personal loan   y
192   30    management         single  ...            no            no  no
234   30       student         single  ...            no            no  no
621   30       unknown         single  ...            no            no  no
669   30    technician         single  ...            no            no  no
703   30   blue-collar         single  ...            no            no  no
791   30  entrepreneur         single  ...            no            no  no
830   30     housemaid         single  ...            no            no  no
876   30    technician         single  ...            no            no  no
996   30   blue-collar         single  ...            no            no  no

[9 rows x 8 columns]

lets impute this broad scope common value to missing value of education

In [71]:
data[(data['age']==30) &
     (data['job']=='admin.') &
     (data['marital status']=='single') &
     (data['credit default?']=='no') &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='no') &
     (data['education'].isnull()) 
    ]

    age     job marital status  ... housing loan? Personal loan   y
97   30  admin.         single  ...            no            no  no

[1 rows x 8 columns]

In [0]:
data.loc[(data['age']==30) &
     (data['job']=='admin.') &
     (data['marital status']=='single') &
     (data['credit default?']=='no') &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='no') &
     (data['education'].isnull()),'education'
    ]=\
data[(data['age']==30) &
     (data['marital status']=='single') &
     (data['credit default?']=='no') &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='no') &
     (data['education'].isnull()==False) 
    ]['education'].mode()[0]

In [73]:
data.isnull().sum()

age                0
job                0
marital status     0
education          0
credit default?    1
housing loan?      0
Personal loan      0
y                  0
dtype: int64

Final missing value attribute is credit default

In [74]:
data[data['credit default?'].isnull()]

     age         job marital status  ... housing loan? Personal loan   y
168   48  technician        married  ...            no            no  no

[1 rows x 8 columns]

In [76]:
data[(data['age']==48) &
     (data['job']=='technician') &
     (data['marital status']=='married') &
     (data['credit default?'].isnull()==False) &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='no') &
     (data['education']=='tertiary')
    ]

Empty DataFrame
Columns: [age, job, marital status, education, credit default?, housing loan?, Personal loan, y]
Index: []

In [77]:
data[(data['age']==48) &     
     (data['marital status']=='married') &
     (data['credit default?'].isnull()==False) &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='no') &
     (data['education']=='tertiary')
    ]

     age         job marital status  ... housing loan? Personal loan   y
62    48  management        married  ...            no            no  no
386   48  management        married  ...            no            no  no

[2 rows x 8 columns]

Lets impute this credit default with the common value in age and with other similar values ignoring the job

In [0]:
data.loc[(data['age']==48) &
     (data['job']=='technician') &
     (data['marital status']=='married') &
     (data['credit default?'].isnull()) &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='no') &
     (data['education']=='tertiary')
    ,'credit default?']=\
data[(data['age']==48) &     
     (data['marital status']=='married') &
     (data['credit default?'].isnull()==False) &
     (data['housing loan?']=='no') &
     (data['Personal loan']=='no') &
     (data['y']=='no') &
     (data['education']=='tertiary')
    ]['credit default?'].mode()[0]

In [80]:
data.isnull().sum()

age                0
job                0
marital status     0
education          0
credit default?    0
housing loan?      0
Personal loan      0
y                  0
dtype: int64

In [81]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1021 entries, 0 to 1020
Data columns (total 8 columns):
age                1021 non-null int64
job                1021 non-null object
marital status     1021 non-null object
education          1021 non-null object
credit default?    1021 non-null object
housing loan?      1021 non-null object
Personal loan      1021 non-null object
y                  1021 non-null object
dtypes: int64(1), object(7)
memory usage: 63.9+ KB

Missing values analysis is done, lets look into the values in each every attribute and clean if it has any improper data or apply mean,median , mode technique for the outliers

In [82]:
data.columns

Index(['age', 'job', 'marital status', 'education', 'credit default?',
       'housing loan?', 'Personal loan', 'y'],
      dtype='object')

In [83]:
data['age'].value_counts()

32    54
34    50
37    48
31    43
42    42
33    41
36    38
35    37
30    37
40    34
41    34
38    32
43    29
39    29
45    29
48    27
55    26
49    25
50    24
53    23
56    21
29    21
44    21
46    21
57    20
27    20
26    20
47    18
52    18
28    17
51    16
54    16
58    14
59    12
25    11
60     8
23     5
24     4
61     4
63     3
69     3
75     3
62     2
65     2
66     2
22     2
21     2
70     2
77     2
78     2
20     1
84     1
64     1
67     1
68     1
71     1
19     1
Name: age, dtype: int64